app/views/recipes/_form.html.haml

          = p.label :ingredient
          = p.collection_select :ingredient_id, Ingredient.all, :id, :name, { :include_blank => true }
---
SELECT "ingredients".* FROM "ingredients"