app/views/recipes/_newpart.html.haml

SELECT "ingredients".* FROM "ingredients"
---
      = p.label :ingredient
      = p.collection_select :ingredient_id, Ingredient.all, :id, :name , { :include_blank => true }