app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    @ingredients = Ingredient.all

SELECT "ingredients".* FROM "ingredients" WHERE ("ingredients"."id" = 1) LIMIT 1
---
  def show
    @ingredient = Ingredient.find(params[:id])

INSERT INTO "ingredients" ("created_at", "name", "updated_at", "user_id", "variety") VALUES ('2010-11-15 22:57:17.098789', 'Kale', '2010-11-15 22:57:17.098789', 1, 'Green')
---
  def create
    @ingredient = Ingredient.new(params[:ingredient])
    @ingredient.user_id = current_user.id
    respond_to do |format|
      if @ingredient.save