app/controllers/parts_controller.rb

  def index
    @parts = Part.all
---
SELECT "parts".* FROM "parts"