app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 0) LIMIT 1
---
  def show
    @recipe = Recipe.find(params[:id])

SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 1) LIMIT 1
---
  def edit
    @recipe = Recipe.find(params[:id])

INSERT INTO "parts" ("amount", "created_at", "ingredient_id", "recipe_id", "updated_at") VALUES (2, '2011-02-16 23:03:00.770245', 1, 1, '2011-02-16 23:03:00.770245')
INSERT INTO "recipes" ("created_at", "description", "name", "updated_at", "user_id") VALUES ('2011-02-16 23:03:00.725032', NULL, 'new recipe', '2011-02-16 23:03:00.725032', NULL)
---
  def create
    @recipe = Recipe.new(params[:recipe])
    @parts = @recipe.parts
    respond_to do |format|
      if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 2) LIMIT 1
---
  def update
    @recipe = Recipe.find(params[:id])

SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 4) LIMIT 1
DELETE FROM "recipes" WHERE ("recipes"."id" = 4)
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy